keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_CCUCON7_Bits.CPU1DIV */
#define IFX_SCU_CCUCON7_CPU1DIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON8_Bits.CPU2DIV */
#define IFX_SCU_CCUCON8_CPU2DIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON8_Bits.CPU2DIV */
#define IFX_SCU_CCUCON8_CPU2DIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON8_Bits.CPU2DIV */
#define IFX_SCU_CCUCON8_CPU2DIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.ADCDIV */
#define IFX_SCU_CCUCON9_ADCDIV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.ADCDIV */
#define IFX_SCU_CCUCON9_ADCDIV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.ADCDIV */
#define IFX_SCU_CCUCON9_ADCDIV_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.ADCSEL */
#define IFX_SCU_CCUCON9_ADCSEL_LEN (2)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.ADCSEL */
#define IFX_SCU_CCUCON9_ADCSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.ADCSEL */
#define IFX_SCU_CCUCON9_ADCSEL_OFF (6)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.LCK */
#define IFX_SCU_CCUCON9_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.LCK */
#define IFX_SCU_CCUCON9_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.LCK */
#define IFX_SCU_CCUCON9_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.SLCK */
#define IFX_SCU_CCUCON9_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.SLCK */
#define IFX_SCU_CCUCON9_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.SLCK */
#define IFX_SCU_CCUCON9_SLCK_OFF (29)

/** \\brief  Length for Ifx_SCU_CCUCON9_Bits.UP */
#define IFX_SCU_CCUCON9_UP_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCON9_Bits.UP */
#define IFX_SCU_CCUCON9_UP_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCON9_Bits.UP */
#define IFX_SCU_CCUCON9_UP_OFF (30)

/** \\brief  Length for Ifx_SCU_CCUCONSM_Bits.BACKREL */
#define IFX_SCU_CCUCONSM_BACKREL_LEN (5)

/** \\brief  Mask for Ifx_SCU_CCUCONSM_Bits.BACKREL */
#define IFX_SCU_CCUCONSM_BACKREL_MSK (0x1f)

/** \\brief  Offset for Ifx_SCU_CCUCONSM_Bits.BACKREL */
#define IFX_SCU_CCUCONSM_BACKREL_OFF (0)

/** \\brief  Length for Ifx_SCU_CCUCONSM_Bits.EN */
#define IFX_SCU_CCUCONSM_EN_LEN (1)

/** \\brief  Mask for Ifx_SCU_CCUCONSM_Bits.EN */
#define IFX_SCU_CCUCONSM_EN_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CCUCONSM_Bits.EN */
#define IFX_SCU_CCUCONSM_EN_OFF (31)

/** \\brief  Length for Ifx_SCU_CCUCONSM_Bits.SPBREL */
#define IFX_SCU_CCUCONSM_SPBREL_LEN (5)

/** \\brief  Mask for Ifx_SCU_CCUCONSM_Bits.SPBREL */
#define IFX_SCU_CCUCONSM_SPBREL_MSK (0x1f)

/** \\brief  Offset for Ifx_SCU_CCUCONSM_Bits.SPBREL */
#define IFX_SCU_CCUCONSM_SPBREL_OFF (8)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_LEN (8)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHID */
#define IFX_SCU_CHIPID_CHID_OFF (8)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_LEN (6)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_OFF (0)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_LEN (2)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_OFF (6)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_LEN (1)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.EEA */
#define IFX_SCU_CHIPID_EEA_OFF (16)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_LEN (4)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.FSIZE */
#define IFX_SCU_CHIPID_FSIZE_OFF (24)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_LEN (1)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_OFF (30)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_LEN (2)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.SP */
#define IFX_SCU_CHIPID_SP_OFF (28)

/** \\brief  Length for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_LEN (7)

/** \\brief  Mask for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_MSK (0x7f)

/** \\brief  Offset for Ifx_SCU_CHIPID_Bits.UCODE */
#define IFX_SCU_CHIPID_UCODE_OFF (17)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.CAL */
#define IFX_SCU_DTSCON_CAL_LEN (20)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.CAL */
#define IFX_SCU_DTSCON_CAL_MSK (0xfffff)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.CAL */
#define IFX_SCU_DTSCON_CAL_OFF (4)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.PWD */
#define IFX_SCU_DTSCON_PWD_OFF (0)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.SLCK */
#define IFX_SCU_DTSCON_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.SLCK */
#define IFX_SCU_DTSCON_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.SLCK */
#define IFX_SCU_DTSCON_SLCK_OFF (31)

/** \\brief  Length for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_LEN (1)

/** \\brief  Mask for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_DTSCON_Bits.START */
#define IFX_SCU_DTSCON_START_OFF (1)

