keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_OFF (4)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_OFF (12)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_LEN (2)

/** \\brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_MSK (0x3)

/** \\brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_OFF (20)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_OFF (0)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR33OVVAL */
#define IFX_SCU_EVROVMON_EVR33OVVAL_OFF (8)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.LCK */
#define IFX_SCU_EVROVMON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.SLCK */
#define IFX_SCU_EVROVMON_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVROVMON_Bits.SWDOVVAL */
#define IFX_SCU_EVROVMON_SWDOVVAL_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_SCU_EVRRSTCON_BPRST33OFF_OFF (27)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_SCU_EVRRSTCON_BPRSTSWDOFF_OFF (29)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.LCK */
#define IFX_SCU_EVRRSTCON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RST33OFF */
#define IFX_SCU_EVRRSTCON_RST33OFF_OFF (26)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_LEN (1)

