keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_SCU_EVRRSTCON_RSTSWDOFF_OFF (28)

/** \\brief  Length for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRRSTCON_Bits.SLCK */
#define IFX_SCU_EVRRSTCON_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.SD5D */
#define IFX_SCU_EVRSDCOEFF1_SD5D_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.SD5D */
#define IFX_SCU_EVRSDCOEFF1_SD5D_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.SD5D */
#define IFX_SCU_EVRSDCOEFF1_SD5D_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.SD5I */
#define IFX_SCU_EVRSDCOEFF1_SD5I_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.SD5I */
#define IFX_SCU_EVRSDCOEFF1_SD5I_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.SD5I */
#define IFX_SCU_EVRSDCOEFF1_SD5I_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF1_Bits.SD5P */
#define IFX_SCU_EVRSDCOEFF1_SD5P_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF1_Bits.SD5P */
#define IFX_SCU_EVRSDCOEFF1_SD5P_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF1_Bits.SD5P */
#define IFX_SCU_EVRSDCOEFF1_SD5P_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33D */
#define IFX_SCU_EVRSDCOEFF2_SD33D_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33D */
#define IFX_SCU_EVRSDCOEFF2_SD33D_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33D */
#define IFX_SCU_EVRSDCOEFF2_SD33D_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33I */
#define IFX_SCU_EVRSDCOEFF2_SD33I_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_LEN (1)

