keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxScu_bf.h
/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_LEN (16)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_MSK (0xffff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_LEN (4)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_OFF (24)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_LEN (6)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_MSK (0x3f)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_OFF (24)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_OFF (16)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_LEN (3)

/** \\brief  Mask for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_MSK (0x7)

/** \\brief  Offset for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_OFF (10)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_MSK (0x1)

