keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxScu_bf.h
/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_OFF (2)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_OFF (9)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_OFF (1)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_OFF (3)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_OFF (4)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_OFF (5)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_OFF (6)

/** \\brief  Length for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_OFF (7)

/** \\brief  Length for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_OFF (0)

/** \\brief  Length for Ifx_SCU_EVRUVMON_Bits.EVR33UVVAL */
#define IFX_SCU_EVRUVMON_EVR33UVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRUVMON_Bits.EVR33UVVAL */
#define IFX_SCU_EVRUVMON_EVR33UVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRUVMON_Bits.EVR33UVVAL */
#define IFX_SCU_EVRUVMON_EVR33UVVAL_OFF (8)

/** \\brief  Length for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_OFF (31)

/** \\brief  Length for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_LEN (1)

/** \\brief  Mask for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_OFF (30)

/** \\brief  Length for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_LEN (8)

/** \\brief  Mask for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_OFF (16)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_LEN (8)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_MSK (0xff)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_OFF (24)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_LEN (1)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_OFF (0)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_LEN (1)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_OFF (16)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_LEN (1)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_OFF (17)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_LEN (4)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_OFF (2)

/** \\brief  Length for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_LEN (4)

/** \\brief  Mask for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_MSK (0xf)

/** \\brief  Offset for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_OFF (18)

/** \\brief  Length for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_LEN (1)

/** \\brief  Mask for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_MSK (0x1)

/** \\brief  Offset for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_OFF (31)

/** \\brief  Length for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_LEN (2)

/** \\brief  Mask for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_MSK (0x3)

